---
kind: method
id: M:Autodesk.Revit.DB.View.Print
zh: 视图
source: html/1ea1e825-8044-7a27-d9b9-ca463443c3b9.htm
---
# Autodesk.Revit.DB.View.Print Method

**中文**: 视图

Print this view with the default view template and using the print setting of the current active document.

## Syntax (C#)
```csharp
public void Print()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the view cannot be printed.